hotdb_scripts/10B_LuMDB_YCSB_performance/LuMDB_10B_val_128_memMiB_zipf1.4_point_read.log
base_num: 10000000000
num_entries: 1000000000
value_size:128
stats_interval: 10000000
10B
../../hotdb/release/db_bench --db=/mnt/hotdb_test/hotdb10B/ycsba_hot__P__1.4_iterator1 --num=1000000000 --ycsb_num=500000 --value_size=128 --batch_size=1000 --benchmarks=ycsba,stats --data_file=/home/jeff-wang/workloads/zipf1.4_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --Read_data_file= --YCSB_data_file=/home/jeff-wang/workloads/random_read_workload1.4.csv --cache_size=0 --open_files=40000 --use_existing_db=true --reads=1000 --compression=0 --stats_interval=10000000 --histogram=1 --print_wa=true
LevelDB:    version 1.23
Date:       Fri Nov 29 12:17:18 2024
CPU:        112 * Intel(R) Xeon(R) Platinum 8180 CPU @ 2.50GHz
CPUCache:   39424 KB
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000000
RawSize:    137329.1 MB (estimated)
FileSize:   76293.9 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
WARNING: Snappy compression is not enabled
some command parameters have been selected:
  threads: 1
  duration: 0
  print_wa: 1
  num_entries: 1000000000
  bechmark selected ycsba,stats
  hot_file_path:
  data_file_path: /home/jeff-wang/workloads/zipf1.4_keys10.0B.csv
  percentages:
  write_buffer_size: 1048576
  Hot data definition: 2
  Print Interval: 10000000
------------------------------------------------
open dbs:in Open()
Before recovering in DBImpl,  save_manifest = false
============================================
Partition:    1 | Start: 0000000000000001     | End: 0000000000000018     | Total files:   257 | Written KVs:    1925994 | Total file size:  276374241 bytes | Avg file size:    1075386 bytes
Partition:    2 | Start: 0000000000000019     | End: 9990992666384032     | Total files:  3920 | Written KVs:   22122726 | Total file size: 3252596835 bytes | Avg file size:     829744 bytes
     Partition:    8 | Start: 0000000000000019     | End: 0000000000020280     | Total files:     0 | Written KVs:          0 | Total file size:          0 bytes | Avg file size:          0 bytes
     Partition:    9 | Start: 0000000000020281     | End: 0000000000041061     | Total files:     0 | Written KVs:          0 | Total file size:          0 bytes | Avg file size:          0 bytes
     Partition:   10 | Start: 0000000000041062     | End: 0000000000092887     | Total files:     0 | Written KVs:          0 | Total file size:          0 bytes | Avg file size:          0 bytes
     Partition:   11 | Start: 0000000000092888     | End: 0000000000268077     | Total files:     0 | Written KVs:          0 | Total file size:          0 bytes | Avg file size:          0 bytes
     Partition:   12 | Start: 0000000000268078     | End: 0000000001629620     | Total files:     0 | Written KVs:          0 | Total file size:          0 bytes | Avg file size:          0 bytes
     Partition:   13 | Start: 0000000001629621     | End: 9990992666384032     | Total files:     0 | Written KVs:          0 | Total file size:          0 bytes | Avg file size:          0 bytes
============================================


2 Mem partitions restored from /mnt/hotdb_test/hotdb10B/ycsba_hot__P__1.4_iterator1/MetaPartition
2417 Hot ranges restored from /mnt/hotdb_test/hotdb10B/ycsba_hot__P__1.4_iterator1/MetaHotRange
Restored partition_first_L0flush_map entries:
Partition 1: true
Partition 2: false
Partition 8: false
Partition 9: false
Partition 10: false
Partition 11: false
Partition 12: false
Partition 13: false
8 partition_first_L0flush_map entries restored from /mnt/hotdb_test/hotdb10B/ycsba_hot__P__1.4_iterator1/PartitionFirstL0FlushMap
we have 1 runs in level 0
we have 4 runs in level 1
we have 4 runs in level 2
we have 4 runs in level 3
we have 4 runs in level 4
we have 4 runs in level 5
we have 4 runs in level 6
After restoring, we have 0 leveling files and 37 Tiering file!
now: save_manifest = true
now we set: save_manifest = true
After restoring,  save_manifest = true
we got 316 files !
we got 303 live files !
find 248202 as a log file!
After recovering in DBImpl,  save_manifest = true
We have created a new mainfest file!
The DB has been opened!
Processing 1 entries in every Batch, FLAGS_ycsb_num = 500000
500000 operations have been finished (68.665 MB data have been written into db)
ycsba        :      12.813 micros/op 78042 ops/sec;   10.7 MB/s
Microseconds per op:
Count: 500000  Average: 12.8132  StdDev: 57.67
Percentiles: P50: 10.31 P75: 11.28 P99: 44.14 P99.9: 567.62 P99.99: 937.93
------------------------------------------------------
[       6,       7 )    4599   0.920%   0.920%
[       7,       8 )   50131  10.026%  10.946% ##
[       8,       9 )   65169  13.034%  23.980% ###
[       9,      10 )   89728  17.946%  41.925% ####
[      10,      12 )  259033  51.807%  93.732% ##########
[      12,      14 )   13603   2.721%  96.453% #
[      14,      16 )    4361   0.872%  97.325%
[      16,      18 )    1545   0.309%  97.634%
[      18,      20 )     311   0.062%  97.696%
[      20,      25 )     914   0.183%  97.879%
[      25,      30 )    1270   0.254%  98.133%
[      30,      35 )     982   0.196%  98.329%
[      35,      40 )    2490   0.498%  98.827%
[      40,      45 )    1043   0.209%  99.036%
[      45,      50 )     595   0.119%  99.155%
[      50,      60 )     632   0.126%  99.281%
[      60,      70 )      78   0.016%  99.297%
[      70,      80 )      81   0.016%  99.313%
[      80,      90 )      22   0.004%  99.317%
[      90,     100 )      21   0.004%  99.322%
[     100,     120 )      29   0.006%  99.327%
[     120,     140 )      23   0.005%  99.332%
[     140,     160 )      22   0.004%  99.336%
[     160,     180 )      49   0.010%  99.346%
[     180,     200 )      48   0.010%  99.356%
[     200,     250 )     183   0.037%  99.392%
[     250,     300 )     312   0.062%  99.455%
[     300,     350 )     444   0.089%  99.544%
[     350,     400 )     522   0.104%  99.648%
[     400,     450 )     672   0.134%  99.782%
[     450,     500 )     329   0.066%  99.848%
[     500,     600 )     383   0.077%  99.925%
[     600,     700 )     213   0.043%  99.967%
[     700,     800 )      69   0.014%  99.981%
[     800,     900 )      33   0.007%  99.988%
[     900,    1000 )      29   0.006%  99.994%
[    1000,    1200 )      27   0.005%  99.999%
[    1200,    1400 )       2   0.000%  99.999%
[   10000,   12000 )       2   0.000% 100.000%
[   25000,   30000 )       1   0.000% 100.000%


Disk nvme0n1: Read: 2372677 MB | Write: 74599923 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
[...]
Disk nvme0n1: Read: 128 MB | Write: 0 MB
Disk nvme0n1: Read: 184 MB | Write: 0 MB
Disk nvme0n1: Read: 11 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
Disk nvme0n1: Read: 0 MB | Write: 0 MB
[...]